<h1>Snow Violations</h1>
This analysis looks at 311 complaints filed as "Snow â€“ Uncleared Sidewalk Complaint," or SWSNOREM.<br>
<br>
My analysis steps:
<ol>
<li><a href="#docs">Review API Documentation</a>
<li><a href="#import">Import Libraries</a>
<li><a href="#retrieve_data">Get Data</a>
<li><a href="#summarize">Summarize Data</a>
</ol>

<h3>Possible Next Steps</h3>
<ul>
    <li>TBD
</ul>

<a name = "docs"></a>
    <h1>1. Review API Documentation</h1>

<h3>Socrata Portal Info</h3>
 <ul>
<li><b>API Docs:</b> <a href="https://dev.socrata.com/">https://dev.socrata.com/</a> (general reference for Socrata)<br>
    </ul>   

<h3>311 data</h3>
<ul>
    <li>https://data.cityofchicago.org/Service-Requests/311-Service-Requests/v6vf-nfxy
        <li>API: https://data.cityofchicago.org/resource/v6vf-nfxy.json 
</ul>

<a name = "import"></a>
<h1>2. Import Libraries</h1>

In [1]:
import pandas as pd
import requests
#import datetime as dt #would only need this if I manipulated dates post-API data retrieval

<a name = "retrieve_data"></a>
    <h1>3. Get Data</h1>

In [33]:
base_url = "https://data.cityofchicago.org/resource/v6vf-nfxy.json"
select = "SR_NUMBER, CREATED_DATE, STREET_ADDRESS"
where = "SR_SHORT_CODE='SWSNOREM'"
limit = 99999

url = f"{base_url}?$SELECT={select}&$WHERE={where}&$LIMIT={limit}"
print (url)

https://data.cityofchicago.org/resource/v6vf-nfxy.json?$SELECT=SR_NUMBER, CREATED_DATE, STREET_ADDRESS&$WHERE=SR_SHORT_CODE='SWSNOREM'&$LIMIT=99999

In [34]:
response = requests.get(url)
data = response.json()
print (response)

<Response [200]>

In [35]:
df_311=pd.DataFrame(data)
df_311.head()

       SR_NUMBER             CREATED_DATE      STREET_ADDRESS
0  SR23-01894991  2023-11-01T09:19:22.000  4555 N SHERIDAN RD
1  SR23-01897633  2023-11-01T13:23:12.000  3469 N BROADWAY ST
2  SR23-01903733  2023-11-02T11:59:47.000  5237 W WARWICK AVE
3  SR19-01048063  2019-02-21T10:26:44.000  2548 W RASCHER AVE
4  SR19-00125910  2019-01-28T10:27:35.000   116 W Pershing RD

In [38]:
df_311['year']=df_311['CREATED_DATE'].str[:4]

In [39]:
df_311.head()

       SR_NUMBER             CREATED_DATE      STREET_ADDRESS  year
0  SR23-01894991  2023-11-01T09:19:22.000  4555 N SHERIDAN RD  2023
1  SR23-01897633  2023-11-01T13:23:12.000  3469 N BROADWAY ST  2023
2  SR23-01903733  2023-11-02T11:59:47.000  5237 W WARWICK AVE  2023
3  SR19-01048063  2019-02-21T10:26:44.000  2548 W RASCHER AVE  2019
4  SR19-00125910  2019-01-28T10:27:35.000   116 W Pershing RD  2019

<a name = "summarize"></a>
# 4. Summarize Data

### 311 Complaints by Year

In [43]:
df_311['year'].value_counts().sort_index().reset_index()

   year  count
0  2018      1
1  2019   1978
2  2020   5389
3  2021   6090
4  2022   6807
5  2023   1246

### 311 Complaints by Address

In [47]:
df_311.groupby('STREET_ADDRESS').size().reset_index(name='count').sort_values(by='count', ascending=False)

             STREET_ADDRESS  count
9223     4165 W BERTEAU AVE     49
4962         241 W SCOTT ST     38
7496   3330 N LAKE SHORE DR     25
5023     2424 N KEDZIE BLVD     24
12098    579 W HAWTHORNE PL     24
...                     ...    ...
5668       2635 N EMMETT ST      1
5669      2635 N KEDZIE AVE      1
5670     2635 N MARMORA AVE      1
5672         2635 W 55TH ST      1
15070          9959 S J AVE      1

[15071 rows x 2 columns]